---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainEffectivethroat
source: html/98571128-64d0-073a-04ca-cf3d81d01df6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainEffectivethroat Property

"Main Effective Throat"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainEffectivethroat { get; }
```